{"d1e3": {"l": "./chapter-7.html#topic_ynm_jjd_ddc","t": "Chapter 7: The Name Revealed","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Final Guess On the third day, the little man returned, eager to hear the queen’s final attempt. She watched him closely, hiding the confidence that had come with knowing his name. She pretended to ponder, listing a few more names that she knew were wrong, as he watched ...</p></div>"},"d1e10": {"l": "./chapter-3.html#topic_ynm_jjd_ddc","t": "Chapter 3: The Second Test","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Second Room After seeing the room full of gold, the king was excited to see even more. He led the miller's daughter to an even larger room piled high with straw. The task was clear—she was to spin all of this straw into gold by morning. Without a word, he closed the doo...</p></div>"},"d1e17": {"l": "./chapter-1.html#topic_ynm_jjd_ddc","t": "Chapter 1: The Miller's Boast","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Miller and his Daughter There was once a miller who lived with his only daughter. His daughter was beautiful with hair like strands of fine gold. She was also talented with the spinning wheel. The miller was very proud of his daughter and bragged to everyone about how b...</p></div>"},"d1e24": {"l": "./chapter-2.html#topic_ynm_jjd_ddc","t": "Chapter 2: The First Test","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Girl Loses Hope The girl sat on a small stool in the middle of the room, looking at the straw all around her. She knew that she could never spin any of that straw into gold. Not in one night, or her entire lifetime. She began to cry, certain that she and her father woul...</p></div>"},"d1e31": {"l": "./chapter-4.html#topic_ynm_jjd_ddc","t": "Chapter 4: The Final Test","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Largest Room Despite the king’s satisfaction with the gold, his excitement grew even more. He led the miller’s daughter to the largest room in the castle, filled from floor to ceiling with piles of straw. The task was the same as before—she must spin it all into gold by...</p></div>"},"d1e39": {"l": "./index.html#topic_inm_yt2_bdc","t": "Rumpelstiltskin","d": "<p class=\"shortdesc\"> Adapted for<span class=\"ph\"> children </span>by Martin Jensen </p> "},"d1e46": {"l": "./chapter-5.html#topic_ynm_jjd_ddc","t": "Chapter 5: Marriage and a Child","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Wedding With each room of gold he had seen, the king grew more pleased with the miller’s daughter. Soon, he decided to marry her, making her queen. The girl, now queen, lived in a grand palace, surrounded by the luxuries of royal life, and her father no longer needed to...</p></div>"},"d1e53": {"l": "./chapter-6.html#topic_ynm_jjd_ddc","t": "Chapter 6: The Three-Day Challenge","d": "<div class=\"abstract\"><p class=\"shortdesc\">The Bargin Seeing the queen’s distress, the little man decided to offer her one last chance. He told her that if she could guess his name within three days, she would be able to keep her child. However, if she failed, the child would be his forever. The queen felt a small b...</p></div>"}}